Revit 2023 API
ElementId.InvalidElementId Property
 Get the invalid ElementId whose IntegerValue is -1.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
Syntax
C#
public static ElementId InvalidElementId { get; }
Visual Basic
Public Shared ReadOnly Property InvalidElementId As ElementId
	Get
Visual C++
public:
static property ElementId^ InvalidElementId {
	ElementId^ get ();
}
See Also
ElementId Class
Autodesk.Revit.DB Namespace